Tekla Open API Reference for Tekla Structures 2025
ParametricProfileItem.SelectByPrefix Method
 Selects the parametric profile item in the profile database using the given prefix.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SelectByPrefix(
	string ProfilePrefix
)
Public Function SelectByPrefix (
	ProfilePrefix As String
) As Boolean
Parameters
ProfilePrefix
Type: System.String
The prefix of the profile name to be select.
Return Value
Type: Boolean
True on success.
See Also
Reference
ParametricProfileItem Class
Tekla.Structures.Catalogs Namespace